app/views/jobs/_all_jobs.html.erb

SELECT "boats".* FROM "boats" INNER JOIN "boatjobs" ON "boats"."id" = "boatjobs"."boat_id" WHERE "boatjobs"."job_id" = ?  [["job_id", 1]]
---
<h3>Name: <%= job.name %></h3>
Boats: <% job.boats.each do |boat| %>