app/controllers/boats_controller.rb

SELECT "boats".* FROM "boats"
---
  def index
    @boats = Boat.all

SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @boat = Boat.find(params[:id])

SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @boats = Boat.find(params[:id])

INSERT INTO "boats" ("created_at", "updated_at", "user_id", "name", "containers", "location") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", 2016-12-16 23:34:14 UTC], ["updated_at", 2016-12-16 23:34:14 UTC], ["user_id", 2], ["name", "Titanic"], ["containers", 50], ["location", "New York"]]
---
  def create
    @boat = current_user.boats.new(boat_params)
    if @boat.save

SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "boats" SET "avatar_updated_at" = ?, "updated_at" = ?, "avatar_file_name" = ? WHERE "boats"."id" = ?  [["avatar_updated_at", 2016-12-21 00:53:27 UTC], ["updated_at", 2016-12-21 00:53:27 UTC], ["avatar_file_name", "arizona.jpeg"], ["id", 12]]
---
  def update
    @boat = Boat.find(params[:id]).update_attributes(boat_params)