app/controllers/boats_controller.rb

  def show
    @boats = Boat.all
---
SELECT "boats".* FROM "boats"