app/controllers/exercises_controller.rb

  def create
    @exercise = Exercise.new(exercise_params)
    if @exercise.save
---
INSERT INTO "exercises" ("name", "category", "primary_muscle", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Straight Bar Curls"], ["category", "Arms"], ["primary_muscle", "Biceps"], ["created_at", 2018-01-24 06:15:50 UTC], ["updated_at", 2018-01-24 06:15:50 UTC]]