app/controllers/jobs_controller.rb

  def new
    @job = Job.new
    @boat = Boat.find(params[:boat_id])
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
     @boat = Boat.find(params[:boat_id]) #finds the boat you've selected
     @job = @boat.jobs.new(job_params) #creates a new job for that boat
    if @job.save
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "boatjobs" ("created_at", "updated_at", "job_id", "boat_id") VALUES (?, ?, ?, ?)  [["created_at", 2016-12-17 00:44:50 UTC], ["updated_at", 2016-12-17 00:44:50 UTC], ["job_id", 6], ["boat_id", 1]]

  def addboats
    puts "THESE ARE THE PARAMS: #{params.inspect}"
    @job = Job.find(params[:job_id]) #find the job id of the job selected
    params[:addingboats].each do |boat_id|
    @boat = Boat.find(boat_id) #find the boat id of the boat selected
      respond_to do |format|
        if @job.boats << @boat #adds the job and boat to create the "boatjob"
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "boatjobs" ("created_at", "updated_at", "job_id", "boat_id") VALUES (?, ?, ?, ?)  [["created_at", 2016-12-20 18:14:00 UTC], ["updated_at", 2016-12-20 18:14:00 UTC], ["job_id", 1], ["boat_id", 1]]