app/views/boats/_all_boats.html.erb

<%= form_tag  '/addingboats',  method: :post, remote: true, id: "boatform" do %>
	<% Boat.all.each do |boat| %>
---
SELECT "boats".* FROM "boats"